<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8493d0277593e00186819ce476519fce1843472b1e68b4ffb64e897c9da5a531","plan_job_ref":"Job Terraform Plan #521 at https://github.com/cal-itp/data-infra/actions/runs/17773786261","plan_out_hash":"3a7537c04473cef44230f313a269a7c4268d385b30817c1a595d229f3d187888","plan_hash":"5378705b35123c5aa8e431a31b135bf7a14b2a71b6af9ac339614ea09a84a8ce","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/sftp/us/enghouse__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_pod_v1.enghouse-sftp will be created
+   resource "kubernetes_pod_v1" "enghouse-sftp" {
+       id = (known after apply)

+       metadata {
+           annotations      = {
+               "gke-gcsfuse/volumes" = "true"
            }
+           generation       = (known after apply)
+           labels           = {
+               "app" = "enghouse-sftp"
            }
+           name             = "enghouse-sftp-pod"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           automount_service_account_token  = true
+           dns_policy                       = "ClusterFirst"
+           enable_service_links             = true
+           host_ipc                         = false
+           host_network                     = false
+           host_pid                         = false
+           hostname                         = (known after apply)
+           node_name                        = (known after apply)
+           restart_policy                   = "Always"
+           scheduler_name                   = (known after apply)
+           service_account_name             = "sftp-pod-service-account"
+           share_process_namespace          = false
+           termination_grace_period_seconds = 30

+           container {
+               command                    = [
+                   "/bin/sh",
+                   "-c",
+                   <<-EOT
                        apk update
                                apk add openssh-server
                                addgroup sftpusers
                                adduser -S -G sftpusers -s /sbin/nologin -D -H enghouse
                                echo 'enghouse:enghousesftpuserpassword' | chpasswd
                        
                                mkdir -p /home/enghouse/.ssh
                                cp /tmp/ssh-keys/authorized_keys /home/enghouse/.ssh/authorized_keys
                                chmod 700 /home/enghouse/.ssh
                                chmod 600 /home/enghouse/.ssh/authorized_keys
                                chown -R enghouse:sftpusers /home/enghouse/.ssh
                        
                                echo "HostKey /etc/ssh/hostkey/id_rsa" >> /etc/ssh/sshd_config
                                echo "PasswordAuthentication no" >> /etc/ssh/sshd_config
                                echo "PermitRootLogin no" >> /etc/ssh/sshd_config
                                echo "X11Forwarding no" >> /etc/ssh/sshd_config
                                echo "AllowTcpForwarding no" >> /etc/ssh/sshd_config
                                echo "ForceCommand internal-sftp" >> /etc/ssh/sshd_config
                                echo "ChrootDirectory %h" >> /etc/ssh/sshd_config
                                /usr/sbin/sshd -D -e
                    EOT,
                ]
+               image                      = "alpine"
+               image_pull_policy          = (known after apply)
+               name                       = "sftp-server"
+               stdin                      = false
+               stdin_once                 = false
+               termination_message_path   = "/dev/termination-log"
+               termination_message_policy = (known after apply)
+               tty                        = false

+               env {
+                   name  = "SFTP_USER"
+                   value = "enghouse"
                }

+               liveness_probe {
+                   failure_threshold     = 3
+                   initial_delay_seconds = 180
+                   period_seconds        = 30
+                   success_threshold     = 1
+                   timeout_seconds       = 1

+                   tcp_socket {
+                       port = "22"
                    }
                }

+               port {
+                   container_port = 22
+                   protocol       = "TCP"
                }

+               resources (known after apply)

+               volume_mount {
+                   mount_path        = "/home/enghouse/data"
+                   mount_propagation = "None"
+                   name              = "gcs-volume"
+                   read_only         = false
                }
+               volume_mount {
+                   mount_path        = "/etc/ssh/hostkey"
+                   mount_propagation = "None"
+                   name              = "sftp-hostkeys"
+                   read_only         = true
                }
+               volume_mount {
+                   mount_path        = "/tmp/ssh-keys"
+                   mount_propagation = "None"
+                   name              = "sftp-authorizedkey"
+                   read_only         = true
                }
            }

+           image_pull_secrets (known after apply)

+           readiness_gate (known after apply)

+           volume {
+               name = "gcs-volume"

+               csi {
+                   driver            = "gcsfuse.csi.storage.gke.io"
+                   volume_attributes = {
+                       "bucketName"   = "cal-itp-data-infra-staging-enghouse-raw"
+                       "mountOptions" = "file-mode=666,dir-mode=777"
                    }
                }
            }
+           volume {
+               name = "sftp-hostkeys"

+               secret {
+                   default_mode = "0600"
+                   secret_name  = "enghouse-sftp-hostkeys"
                }
            }
+           volume {
+               name = "sftp-authorizedkey"

+               secret {
+                   default_mode = "0600"
+                   secret_name  = "enghouse-sftp-authorizedkey"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #521](https://github.com/cal-itp/data-infra/actions/runs/17773786261)